class Menu:
    def main_menu(self):
        print("""
    -------------------------------
        MBC 아카데미 LMS 프로그램    
    -------------------------------
        1. 회원관리 
        2. 성적관리
        3. 게시판
        4. 교보재관리
        5. 관리자
    -------------------------------
        0. 프로그램 종료   
        """)

    def member_menu(self):
        print("""
    -------------------------------
           MBC 아카데미 회원관리    
    -------------------------------
        1. 로그인 
        2. 회원가입
        3. 내정보 변경
        4. 회원탈퇴
    -------------------------------
        9. 로그아웃
        0. 뒤로이동 
        """)
    def score_menu(self):
        print("""
    -------------------------------
           MBC 아카데미 성적관리    
    -------------------------------
        1. 내성적조회 
    -------------------------------
        2. 학생성적등록
        3. 학생성적수정
        4. 학생성적삭제
    -------------------------------
        9. 로그아웃
        0. 뒤로이동   
        """)
    def board_menu(self):
        print("""
    -------------------------------
           MBC 아카데미 게시판    
    -------------------------------
        1. 새글등록
        2. 게시판
        3. 게시글 수정
        4. 게시글 삭제
    -------------------------------
        9. 로그아웃
        0. 뒤로이동   
        """)
    def item_menu(self):
        print("""
    -------------------------------
          MBC 아카데미 교보재관리    
    -------------------------------
        1. 교보재등록
        2. 교보재조회
        3. 교보재수정
        4. 교보재삭제
    -------------------------------
        9. 로그아웃
        0. 뒤로이동  
        """)