class Menu:
    def main_menu(self) :
        print("""
    ╔════════════════════════════════════╗
    ║        🔓 MBC 아카데미 MENU 🔓      ║
    ╚════════════════════════════════════╝
      1.  회원가입                       
      2.  로그인                         
      3.  공지사항                       
      4.  자유게시판                      
    ══════════════════════════════════════                                    
      0.   프로그램 종료                  
    ══════════════════════════════════════""")

    def user_menu(self) :
        print("""
    ╔════════════════════════════════════╗
    ║        🔓 MBC 아카데미 MENU 🔓      ║
    ╚════════════════════════════════════╝
      1.  마이페이지                       
      2.  내정보수정                         
      3.  성적조회                       
      4.  수강과목조회
      5.  자유게시판
      6.  자유게시판 |글 작성
      7.  자유게시판 |내 글 관리  
      8.  로그아웃
      9.  회원탈퇴                   
    ══════════════════════════════════════                                    
      0.  프로그램 종료                  
    ══════════════════════════════════════""")

    def professor_menu(self) :
        print("""
    ╔════════════════════════════════════╗
    ║        🔓 MBC 아카데미 MENU 🔓      ║
    ╚════════════════════════════════════╝
      1.  마이페이지                       
      2.  내정보수정                         
      3.  담당과목관리                       
      4.  학생성적입력
      5.  학생성적조회
      6.  학생성적수정
      7.  자유게시판 
      8.  자유게시판 |글 작성   
      9.  자유게시판 |내 글 관리                  
    ══════════════════════════════════════                                    
      0.  프로그램 종료                  
    ══════════════════════════════════════""")

    def admin_menu(self) :
        print("""
    ╔════════════════════════════════════╗
    ║        🔓 MBC 아카데미 MENU 🔓      ║
    ╚════════════════════════════════════╝
      1.  관리자 대시보드                       
      2.  회원목록조회                         
      3.  회원권한관리                       
      4.  회원정보수정
      5.  회원비활성화처리
      6.  전체성적관리
      7.  게시판관리   
      8.  로그아웃         
    ══════════════════════════════════════                                    
      0.  프로그램 종료                  
    ══════════════════════════════════════""")

